function [ a ] = somActivation( pattern, neighborDist )
% υπολογισμός της ενεργοποίησης ενός SOM
% pattern πίνακας Dx1 που περιέχει διατεταγμένα τα χαρακτηριστικά ενός
% προτύπου εισόδου, δηλαδή ουσιαστικά είναι ένα διάνυσμα στήλη διάστασης D.
% neighborDist η απόσταση (στο πλέγμα του SOM) εντός της οποίας εάν
% βρίσκεται ένας νευρώνας θεωρείται γειτονικός του νευρώνα νικητή.
% a πίνακας Nx1 που συνίσταται από τις τιμές των ενεργοποιήσεων όλων των
% νευρώνων ενός SOM.
% Η παραπάνω συνάρτηση υπολογίζει τις ενεργοποιήσεις όλων των νευρώνων
% του SOM ως εξής: Ο νευρώνας νικητής λαμβάνει τιμή ενεργοποίησης 1, οι νευρώνες
% που θεωρούνται γειτονικοί σε αυτόν (δηλαδή αυτοί που βρίσκονται σε απόσταση 
% neighborDist) λαμβάνουν τιμές μικρότερες του 1 (συνήθης τιμή είναι η 0.5) και όλοι οι
% υπόλοιποι νευρώνες έχουν τιμή ενεργοποίησης 0.end

global distances N;

a = zeros(N, 1);
winner = find(somOutput(pattern));
a(distances(winner, :) < neighborDist) = 0.5;
a(winner) = 1;

end