function [ output ] = somOutput( pattern )
% υπολογισμός της εξόδου ενός SOM
% pattern πίνακας Dx1 που περιέχει διατεταγμένα τα χαρακτηριστικά ενός
% προτύπου εισόδου, δηλαδή ουσιαστικά είναι ένα διάνυσμα στήλη διάστασης D.
%
% output πίνακας Nx1 που περιέχει το σύνολο των εξόδων του SOM, οι τιμές 
% των εξόδων ενός SOM είναι όλες 0 εκτός της τιμής του κόμβου νικητή που είναι 1.
% Η εν λόγω συνάρτηση σε πρώτη φάση υπολογίζει την αρνητική Ευκλείδεια
% απόσταση μεταξύ του προτύπου εισόδου και του διανύσματος παραμέτρων κάθε
% νευρώνα του SOM, ενώ σε δεύτερη φάση βρίσκει τον νευρώνα με τη μεγαλύτερη τιμή
% και θέτει την έξοδο του στο 1.

global IW;

patternFromNeuronNegDistance = negdist(IW, pattern);
output = compet(patternFromNeuronNegDistance);

end

